Tekla Open API Reference for Tekla Structures 2025
WeldMark.ModelIdentifier Property
 When instance refers to welding mark related to a weld in model database, ModelIdentifier has a value. When instance refers to weld mark created with drawing editor UI, value is zero.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ModelIdentifier { get; }
Public ReadOnly Property ModelIdentifier As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
WeldMark Class
Tekla.Structures.Drawing Namespace